In [1]:
!pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\aayush\anaconda3\lib\site-packages (8.3.0)

WARNING: Ignoring invalid distribution -atplotlib (c:\users\aayush\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -illow (c:\users\aayush\anaconda3\lib\site-packages)
WARNING: Error parsing requirements for plotly: [Errno 2] No such file or directory: 'c:\\users\\aayush\\anaconda3\\lib\\site-packages\\plotly-5.14.1.dist-info\\METADATA'
WARNING: Ignoring invalid distribution -atplotlib (c:\users\aayush\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -illow (c:\users\aayush\anaconda3\lib\site-packages)

In [2]:
import mysql.connector  		#importing database
database = mysql.connector.connect(
    host="localhost",
    user="root",
    password="",
    database = "python3pm"
)
db = database.cursor()

In [4]:
db.execute("SELECT * FROM student")
result =db.fetchall()
for x in result:
    print(x)

(1, 'Rama', 89, 98, 85, 67, 89, 420, 82.5, 'A')
(3, 'Nabin', 82, 84, 85, 98, 89, 430, 88.5, 'A')
(4, 'Shiva', 49, 57, 25, 98, 89, 400, 70.0, 'A')
(8, 'Ram', 78, 79, 93, 67, 78, 415, 83.5, 'A')
(10, 'Sameer', 89, 67, 80, 98, 89, 412, 82.5, 'A')
(11, 'Rama', 89, 45, 65, 87, 78, 364, 72.8, 'B')
(12, 'Ram', 87, 90, 65, 78, 87, 407, 81.4, 'A')
(13, 'Gauri', 98, 78, 90, 87, 78, 431, 86.2, 'A')
(40, 'Hari', 89, 89, 89, 78, 87, 412, 83.0, 'A')

In [6]:
db.execute("SELECT sn,name,total,grade FROM student")
result =db.fetchall()
for x in result:
    print(x)

(1, 'Rama', 420, 'A')
(3, 'Nabin', 430, 'A')
(4, 'Shiva', 400, 'A')
(8, 'Ram', 415, 'A')
(10, 'Sameer', 412, 'A')
(11, 'Rama', 364, 'B')
(12, 'Ram', 407, 'A')
(13, 'Gauri', 431, 'A')
(40, 'Hari', 412, 'A')

In [7]:
db.execute("SELECT * FROM student WHERE grade = 'A' ")
result =db.fetchall()
for x in result:
    print(x)

(1, 'Rama', 89, 98, 85, 67, 89, 420, 82.5, 'A')
(3, 'Nabin', 82, 84, 85, 98, 89, 430, 88.5, 'A')
(4, 'Shiva', 49, 57, 25, 98, 89, 400, 70.0, 'A')
(8, 'Ram', 78, 79, 93, 67, 78, 415, 83.5, 'A')
(10, 'Sameer', 89, 67, 80, 98, 89, 412, 82.5, 'A')
(12, 'Ram', 87, 90, 65, 78, 87, 407, 81.4, 'A')
(13, 'Gauri', 98, 78, 90, 87, 78, 431, 86.2, 'A')
(40, 'Hari', 89, 89, 89, 78, 87, 412, 83.0, 'A')

In [ ]:
# Insert
sql = '''INSERT INTO `student` (`sn`, `name`, `physics`, `chemistry`, `math`, `english`, `nepali`,
`total`, `per`, `grade`) 
VALUES ('16', 'Sabin', '78', '86', '98', '66', '68', '410', '84', 'A');'''
db.execute(sql)
database.commit()

In [3]:
name = input("Enter name = ")
physics = int(input("Enter physics marks = "))
chemistry = int(input("Enter chemistry marks = "))
math = int(input("Enter math marks = "))
english = int(input("Enter english marks = "))
nepali = int(input("Enter nepali = "))

total = physics + chemistry + math + english + nepali
per = total/5

if per >= 80:
    grade = "A"
elif per >=60:
    grade = "B"
elif per >= 45:
    grade = "C"
else:
    grade = "F"
    
# Insert
sql = f'''INSERT INTO student (name,physics,chemistry,math,english,nepali,
total, per, grade) 
VALUES ( '{name}',{physics},{chemistry},{math},{english},{nepali},{total},{per}, '{grade}')'''
db.execute(sql)
database.commit()

Enter name = Ram
Enter physics marks = 89
Enter chemistry marks = 90
Enter math marks = 77
Enter english marks = 87
Enter nepali = 67

In [4]:
# Update
sql = "UPDATE student SET chemistry = 97,physics=90 WHERE student.sn = 1"
db.execute(sql)
database.commit()

In [5]:
# Update
subject = input("Enter subject = ")
marks = int(input("Enter marks = "))
sn = int(input("Enter sn = "))

sql = f"UPDATE student SET {subject} = {marks} WHERE student.sn = {sn}"
db.execute(sql)
database.commit()

Enter subject = math
Enter marks = 99
Enter sn = 3

In [6]:
print(sql)

UPDATE student SET math = 99 WHERE student.sn = 3

In [9]:
# Delete
sn = int(input("Enter sn = "))
sql = f"DELETE FROM student WHERE sn = {sn}"
db.execute(sql)
database.commit()

Enter sn = 8